---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetWebThicknessInHeightCenter
source: html/285a4389-b293-b60e-bb46-1395687b1d0f.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT.GetWebThicknessInHeightCenter Method

Returns thickness of web measured in the 0.5 * height,

## Syntax (C#)
```csharp
public double GetWebThicknessInHeightCenter()
```